# https://github.com/ibraheemdev/modern-unix

tap "homebrew/bundle"

brew "bat"
brew "bottom"
brew "dog"
brew "duf"
brew "eza"
brew "exiftool"
brew "fastmod"
brew "fd"
brew "fx"
brew "fzf"
brew "gdu"
brew "git"
brew "git-delta"
brew "go"
# brew "golangci-lint"
# brew "gopls"
brew "grpcurl"
# brew "jq"
brew "helm"
# brew "htop"
# brew "httpie"
brew "kind"
brew "kubernetes-cli"
brew "lazygit"
brew "llvm"
brew "make"
brew "mas"
brew "neovim"
brew "pkgconfig"
brew "ripgrep"
brew "rustup"
brew "rust-analyzer"
brew "starship"
brew "tmux"
brew "tree-sitter"
brew "wget"
brew "xh"

cask "alacritty"
cask "disk-inventory-x"
cask "docker"
cask "firefox"
cask "macdown"
cask "slack"
cask "zoom"
cask "zulip"

cask "font-meslo-lg-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-mononoki-nerd-font"

mas "Xcode", id: 497799835
