tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"

brew "exiftool"
brew "fastmod"
brew "fish"
brew "fzf"
brew "git"
brew "gh"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "jq"
brew "helm"
brew "kind"
brew "kubernetes-cli"
brew "llvm"
brew "mas"
brew "neovim"
brew "node"
brew "pkgconfig"
brew "python"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "rust-analyzer"
brew "tmux"
brew "wget"

cask "1password"
cask "arq5"
cask "chirp"
cask "cubicsdr"
cask "discord"
cask "docker"
cask "fantastical"
cask "firefox"
cask "gqrx"
cask "imageoptim"
cask "macdown"
cask "slack"
cask "tor-browser"
cask "zoom"

mas "Xcode", id: 497799835
