# https://github.com/ibraheemdev/modern-unix

tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"

brew "bat"
brew "diff-so-fancy"
brew "duf"
brew "exa"
brew "exiftool"
brew "fastmod"
brew "fish"
brew "fx"
brew "fzf"
brew "git"
brew "gh"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "jq"
brew "helm"
brew "hexyl"
brew "htop"
brew "kind"
brew "kubernetes-cli"
brew "llvm"
brew "mas"
brew "neovim"
brew "node"
brew "pkgconfig"
brew "python"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "rust-analyzer"
brew "starship"
brew "terraform-ls"
brew "tmux"
brew "wget"

cask "1password"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "fantastical"
cask "fig"
cask "firefox"
cask "macdown"
cask "obsidian"
cask "slack"
cask "zoom"

mas "Xcode", id: 497799835
